# Taps
tap "mongodb/brew"

# Editing
brew "fd"
brew "fzf"
brew "lazygit"
brew "neovim"
brew "ripgrep"
brew "tree-sitter"
cask "copilot-cli"
cask "ghostty"

# Services
brew "docker"

# Development
brew "gh"
brew "git"
brew "mas"
brew "mongodb-database-tools"
cask "microsoft-azure-storage-explorer"
cask "mongodb-compass"
cask "ngrok"
cask "postman"

# Misc utilities
brew "btop"
cask "breaktimer"
cask "itsycal"
cask "rectangle"
cask "stats"
mas "SponsorBlock for Safari", id: 1573461917
mas "uBlock Origin Lite", id: 6745342698

# Programs
cask "bitwarden"
cask "brave-browser"
cask "firefox"
cask "google-chrome"
cask "lm-studio"
cask "slack"

# Fonts
cask "font-jetbrains-mono-nerd-font"
