# # ---- WORK ----
# # Taps
# tap "mongodb/brew"
# # Development
# brew "gh"
# brew "mongodb-database-tools"
# cask "microsoft-azure-storage-explorer"
# cask "mongodb-compass"
# cask "ngrok"
# cask "postman"
# # Misc utilities
# cask "breaktimer"
# # Programs
# cask "brave-browser"
# cask "firefox"
# cask "google-chrome"
# cask "lm-studio"
# cask "slack"

# ---- PERSONAL ----
# Editing
brew "fd"
brew "fzf"
brew "lazygit"
brew "neovim"
brew "ripgrep"
brew "tree-sitter"
cask "copilot-cli"
cask "ghostty"
# Services
brew "docker"
# Development
brew "git"
brew "mas"
# Misc utilities
brew "btop"
cask "itsycal"
cask "rectangle"
cask "stats"
mas "SponsorBlock for Safari", id: 1573461917
mas "uBlock Origin Lite", id: 6745342698
# Programs
cask "bitwarden"
# Fonts
cask "font-jetbrains-mono-nerd-font"
